___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

In [ ]:
# Test  - this is a test

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [1, 3, 5, 6]
data

[1, 3, 5, 6]

In [6]:
pd.DataFrame(data=data,
             columns=['col1'],
             index=['a', 'b', 'c', 'd']
             )

   col1
a     1
b     3
c     5
d     6

In [9]:
df=pd.DataFrame (np.arange(1, 24, 2).reshape(3,4), 
             columns=['var1', 'var2', 'var3', 'var4'])

In [11]:
df.head(2)

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15

In [12]:
df.tail(2)

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [13]:
df.sample(n=3)

   var1  var2  var3  var4
2    17    19    21    23
0     1     3     5     7
1     9    11    13    15

In [14]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
df.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [16]:
for i in df.columns:
    print(i)

var1
var2
var3
var4

In [17]:
print(*df.columns)  #split()   #**my_dict

var1 var2 var3 var4

In [18]:
df.columns = (33, 44, 55, 66)

In [19]:
df

   33  44  55  66
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23

In [20]:
df.shape

(3, 4)

In [21]:
df.ndim #len(df.shape)

2

In [22]:
df.size # row *cols

12

In [23]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type(df[33])

pandas.core.series.Series

In [26]:
type(df[33].values)

numpy.ndarray

In [27]:
type(df.columns)

pandas.core.indexes.numeric.Int64Index

In [28]:
type(df.columns.values)

numpy.ndarray

In [29]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [30]:
type(df.index.values)

numpy.ndarray

In [35]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [36]:
my_dict = {'var1':s1, 'var2':s2, 'var3':s3}
my_dict

{'var1': array([5, 5, 8, 8]),
 'var2': array([8, 7, 7, 8]),
 'var3': array([11,  6,  6,  5])}

In [37]:
pd.DataFrame(my_dict)

   var1  var2  var3
0     5     8    11
1     5     7     6
2     8     7     6
3     8     8     5

In [38]:
# You'll often see this in a much more readable form
pd.DataFrame(
    data={'quinn': np.random.randint(2, 10, size=2),
          'pat': np.ones((2, )),
          'mike': np.zeros((2, )),
          },
    index=['red', 'blue'],
    dtype=np.int16
)

      quinn  pat  mike
red       2    1     0
blue      8    1     0

In [43]:
df = pd.read_csv('ornekcsv.csv', delimiter=';')  #1;2;;
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [46]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [47]:
df[1:3]

    a    b    c
1  78   12  2.0
2  78  324  3.0

In [48]:
df1 = pd.DataFrame(my_dict)

In [49]:
df1

   var1  var2  var3
0     5     8    11
1     5     7     6
2     8     7     6
3     8     8     5

In [51]:
df1.index =['a', 'b', 'c', 'd']
df1

   var1  var2  var3
a     5     8    11
b     5     7     6
c     8     7     6
d     8     8     5

In [53]:
#df[1:3]
df1['a': 'c']

   var1  var2  var3
a     5     8    11
b     5     7     6
c     8     7     6

In [54]:
'var1' in df1

True

In [55]:
'a' in df1.index

True

In [59]:
df1.isin([5, 6, 7])

    var1   var2   var3
a   True  False  False
b   True   True   True
c  False   True   True
d  False  False   True

In [60]:
from numpy.random import randn

In [61]:
np.random.seed(100)
np.random.rand()

0.5434049417909654

In [62]:
np.random.rand()

0.27836938509379616

In [63]:
np.random.seed(100)
np.random.rand()

0.5434049417909654

In [64]:
np.random.rand()

0.27836938509379616

In [71]:
np.random.seed(1)
df3 = pd.DataFrame(data=randn(5,4), 
                   index = 'A B C D E'.split(), 
                   columns = 'W X Y Z'.split())

In [72]:
df3

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [74]:
np.random.seed(1)
df3 = pd.DataFrame(randn(5,4), 
             'a b c d e'.split(), 
             'w x y z'.split())
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [75]:
df3['y']

a   -0.528172
b    1.744812
c    1.462108
d    1.133769
e    0.042214
Name: y, dtype: float64

In [76]:
type(df3['y'])

pandas.core.series.Series

In [77]:
df3[['y']]

          y
a -0.528172
b  1.744812
c  1.462108
d  1.133769
e  0.042214

In [78]:
type(df3[['y']])

pandas.core.frame.DataFrame

In [80]:
df3[['y', 'x']]

          y         x
a -0.528172 -0.611756
b  1.744812 -2.301539
c  1.462108 -0.249370
d  1.133769 -0.384054
e  0.042214 -0.877858

In [82]:
df3.y

a   -0.528172
b    1.744812
c    1.462108
d    1.133769
e    0.042214
Name: y, dtype: float64

In [83]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [88]:
df3['a':'c']  #df3['w':'y']

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141

In [90]:
x = df3.copy()
x.columns = [ 'a b c d'.split()]
x

          a         b         c         d
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [91]:
x['a':'c']

          a         b         c         d
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141

In [92]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [93]:
df3['x*y'] = df3['x'] * df3['y']

In [94]:
df3

          w         x         y         z       x*y
a  1.624345 -0.611756 -0.528172 -1.072969  0.323112
b  0.865408 -2.301539  1.744812 -0.761207 -4.015752
c  0.319039 -0.249370  1.462108 -2.060141 -0.364606
d -0.322417 -0.384054  1.133769 -1.099891 -0.435429
e -0.172428 -0.877858  0.042214  0.582815 -0.037058

In [95]:
df3['xxx'] = 1

In [100]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [99]:
df3.drop(['x*y', 'xxx'], axis=1, inplace=True)

In [ ]:
df3.drop(['x*y'])

In [103]:
df3.drop(['e'])

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891

In [104]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [106]:
pd.DataFrame().iloc

In [107]:
pd.DataFrame().loc

In [109]:
m = np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ['var1', 'var2', 'var3', 'var4'])
df4.head(2)

   var1  var2  var3  var4
0     8    29    11    33
1    25    24     2    14

In [110]:
df4.loc[1]

var1    25
var2    24
var3     2
var4    14
Name: 1, dtype: int32

In [111]:
df4.loc[2:5]

   var1  var2  var3  var4
2     4     1    14     7
3    22     7     3    13
4    28    22    12     8
5    14     9    12    13

In [112]:
df4.iloc[2:5]

   var1  var2  var3  var4
2     4     1    14     7
3    22     7     3    13
4    28    22    12     8

In [116]:
df4.index = 'a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a     8    29    11    33
b    25    24     2    14
c     4     1    14     7
d    22     7     3    13
e    28    22    12     8
f    14     9    12    13
g    21    31    37     8
h     5    19    33    14

In [117]:
df4.loc['d':'g']

   var1  var2  var3  var4
d    22     7     3    13
e    28    22    12     8
f    14     9    12    13
g    21    31    37     8

In [121]:
df4.loc['d':'g' ] [['var3' ] ]

   var3
d     3
e    12
f    12
g    37

In [122]:
df4.iloc[2:5, 2] ###

c    14
d     3
e    12
Name: var3, dtype: int32

In [123]:
df4

   var1  var2  var3  var4
a     8    29    11    33
b    25    24     2    14
c     4     1    14     7
d    22     7     3    13
e    28    22    12     8
f    14     9    12    13
g    21    31    37     8
h     5    19    33    14

In [124]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [130]:
df3.loc['a', :]

w    1.624345
x   -0.611756
y   -0.528172
z   -1.072969
Name: a, dtype: float64

In [131]:
df3.loc[:, 'x']

a   -0.611756
b   -2.301539
c   -0.249370
d   -0.384054
e   -0.877858
Name: x, dtype: float64

In [132]:
df3.iloc[0, :]

w    1.624345
x   -0.611756
y   -0.528172
z   -1.072969
Name: a, dtype: float64

In [133]:
df3.iloc[:, 0]

a    1.624345
b    0.865408
c    0.319039
d   -0.322417
e   -0.172428
Name: w, dtype: float64

import this

In [135]:
df3.iloc[:, [2]]

          y
a -0.528172
b  1.744812
c  1.462108
d  1.133769
e  0.042214

In [136]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [141]:
df3.iloc[0, 1]

-0.6117564136500754

In [142]:
df3[df3 > .5]

          w   x         y         z
a  1.624345 NaN       NaN       NaN
b  0.865408 NaN  1.744812       NaN
c       NaN NaN  1.462108       NaN
d       NaN NaN  1.133769       NaN
e       NaN NaN       NaN  0.582815

In [150]:
# step 1
(df3 > .5)

       w      x      y      z
a   True  False  False  False
b   True  False   True  False
c  False  False   True  False
d  False  False   True  False
e  False  False  False   True

In [152]:
# step 2
df3[df3 > .5]

          w   x         y         z
a  1.624345 NaN       NaN       NaN
b  0.865408 NaN  1.744812       NaN
c       NaN NaN  1.462108       NaN
d       NaN NaN  1.133769       NaN
e       NaN NaN       NaN  0.582815

In [166]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [167]:
df3[df3['z']>.5]

          w         x         y         z
e -0.172428 -0.877858  0.042214  0.582815

In [168]:
df3['z']>.5

a    False
b    False
c    False
d    False
e     True
Name: z, dtype: bool

In [169]:
df3[df3['z']>.5]

          w         x         y         z
e -0.172428 -0.877858  0.042214  0.582815

In [170]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [180]:
df3[df3['x']<-1] [['y','z']]

          y         z
b  1.744812 -0.761207

In [175]:
df3['x']<-1

a    False
b     True
c    False
d    False
e    False
Name: x, dtype: bool

In [181]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [ ]:
df3[df3['y'] > 0] [['z', 'w', 'y' ]]

In [182]:
df3['y'] > 0

a    False
b     True
c     True
d     True
e     True
Name: y, dtype: bool

In [183]:
df3[df3['y'] > 0]

          w         x         y         z
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [185]:
df3[df3['y'] > 0][['z', 'w', 'y' ]]

          z         w         y
b -0.761207  0.865408  1.744812
c -2.060141  0.319039  1.462108
d -1.099891 -0.322417  1.133769
e  0.582815 -0.172428  0.042214

In [186]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [188]:
df3[(df3['w']>0) & (df3['y']<1)]

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969

In [189]:
(df3['w']>0)

a     True
b     True
c     True
d    False
e    False
Name: w, dtype: bool

In [190]:
(df3['y']<1)

a     True
b    False
c    False
d    False
e     True
Name: y, dtype: bool

In [193]:
# python is lazy

a = 1
if a or 1/0:
    print('hey1')

hey1

In [194]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [196]:
df3.loc[(df3.x > -1) ,  ['x', 'y']  ]

          x         y
a -0.611756 -0.528172
c -0.249370  1.462108
d -0.384054  1.133769
e -0.877858  0.042214

In [197]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [198]:
df3.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [203]:
df3.reset_index(inplace=True)

In [204]:
df3

  index         w         x         y         z
0     a  1.624345 -0.611756 -0.528172 -1.072969
1     b  0.865408 -2.301539  1.744812 -0.761207
2     c  0.319039 -0.249370  1.462108 -2.060141
3     d -0.322417 -0.384054  1.133769 -1.099891
4     e -0.172428 -0.877858  0.042214  0.582815

In [209]:
df3.index=df3['index']

In [210]:
df3

      index         w         x         y         z
index
a         a  1.624345 -0.611756 -0.528172 -1.072969
b         b  0.865408 -2.301539  1.744812 -0.761207
c         c  0.319039 -0.249370  1.462108 -2.060141
d         d -0.322417 -0.384054  1.133769 -1.099891
e         e -0.172428 -0.877858  0.042214  0.582815

In [211]:
df3.reset_index(drop=True, inplace=True)

In [212]:
df3

  index         w         x         y         z
0     a  1.624345 -0.611756 -0.528172 -1.072969
1     b  0.865408 -2.301539  1.744812 -0.761207
2     c  0.319039 -0.249370  1.462108 -2.060141
3     d -0.322417 -0.384054  1.133769 -1.099891
4     e -0.172428 -0.877858  0.042214  0.582815

In [213]:
df3.drop(['index'], axis=1, inplace=True)
df3

          w         x         y         z
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

In [215]:
newix = ['ca', 'ny', 'or', 'co', 'nh']
df3['newix'] = newix
df3

          w         x         y         z newix
0  1.624345 -0.611756 -0.528172 -1.072969    ca
1  0.865408 -2.301539  1.744812 -0.761207    ny
2  0.319039 -0.249370  1.462108 -2.060141    or
3 -0.322417 -0.384054  1.133769 -1.099891    co
4 -0.172428 -0.877858  0.042214  0.582815    nh

In [217]:
df3.set_index('newix')  # NOT inplace=True

              w         x         y         z
newix
ca     1.624345 -0.611756 -0.528172 -1.072969
ny     0.865408 -2.301539  1.744812 -0.761207
or     0.319039 -0.249370  1.462108 -2.060141
co    -0.322417 -0.384054  1.133769 -1.099891
nh    -0.172428 -0.877858  0.042214  0.582815

In [218]:
translate = {
    'japanese':
    {
        "": 'aardvark',  # "addobakku"
        "":   'python',  # "nishichi hebi"
        "":        'Japan',  # "nihon",
    },
    'english':
    {
        'aardvark': "",
        'python':   "",
        'Japan': ""
    }
}

In [220]:
list(translate.keys())

['japanese', 'english']

In [221]:
translate['japanese']
ni shie ki

{'': 'aardvark', '': 'python', '': 'Japan'}

In [222]:
translate['japanese']['']

'python'

In [223]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [224]:
hier_index=pd.MultiIndex.from_tuples(multi_index)

In [226]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [227]:
df5 = pd.DataFrame(np.random.randn(9,4), 
             index = hier_index, 
             columns=['A','B','C','D']
            )

In [228]:
df5

             A         B         C         D
M1 1  0.380611 -0.747766 -1.317678  1.332910
   2 -0.684540  1.255982  0.496726  0.329276
   3 -0.001190 -0.307293 -0.183537 -0.552975
M2 1 -0.155713  0.572392  0.759955  0.735682
   2  1.013892 -0.738431  0.257707 -1.137452
   3  1.578141 -0.175111 -1.729089 -0.244074
M3 5  0.193080  1.247796 -0.049321 -0.770348
   6 -0.774052  0.610019 -1.547081 -0.204768
   7 -1.468292  0.041553  0.026831 -0.641126

In [233]:
df5.loc['M3'].loc[[5]]

         A         B         C         D
5  0.19308  1.247796 -0.049321 -0.770348

In [234]:
df5.index.names

FrozenList([None, None])

In [236]:
df5.index.names= ['Group', 'Num']

In [237]:
df5.index.names

FrozenList(['Group', 'Num'])

In [240]:
df5.xs('M1')

            A         B         C         D
Num
1    0.380611 -0.747766 -1.317678  1.332910
2   -0.684540  1.255982  0.496726  0.329276
3   -0.001190 -0.307293 -0.183537 -0.552975

In [241]:
df5.xs(['M1',2])

A   -0.684540
B    1.255982
C    0.496726
D    0.329276
Name: (M1, 2), dtype: float64